ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0h321x/TIMG14_1.0.xml
        </group>
    <group id="TIMG14_GEN_EVENT1" name="TIMG14_GEN_EVENT1" instances="1" offset="0x1080" instaddr="0x30" description="">
        <register id="TIMG14_GEN_EVENT1_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="Z" value="0x1" description="Interrupt Source: Zero event (Z)"/>
                <bitenum id="L" value="0x2" description="nterrupt Source: Load event (L)"/>
                <bitenum id="CCD0" value="0x5" description="Interrupt Source: Capture or compare down event (CCD0)"/>
                <bitenum id="CCD1" value="0x6" description="Interrupt Source: Capture or compare down event (CCD1)"/>
                <bitenum id="CCD2" value="0x7" description="Interrupt Source: Capture or compare down event (CCD2)"/>
                <bitenum id="CCD3" value="0x8" description="Interrupt Source: Capture or compare down event (CCD3)"/>
                <bitenum id="CCU0" value="0x9" description="Interrupt Source: Capture or compare up event (CCU0)"/>
                <bitenum id="CCU1" value="0xA" description="Interrupt Source: Capture or compare up event (CCU1)"/>
                <bitenum id="CCU2" value="0xB" description="Interrupt Source: Capture or compare up event (CCU2)"/>
                <bitenum id="CCU3" value="0xC" description="Interrupt Source: Capture or compare up event (CCU3)"/>
                <bitenum id="CCD4" value="0xD" description="Interrupt Source: Compare down event (CCD4)"/>
                <bitenum id="CCD5" value="0xE" description="Interrupt Source: Compare down event (CCD5)"/>
                <bitenum id="CCU4" value="0xF" description="Interrupt Source: Compare down event (CCU4)"/>
                <bitenum id="CCU5" value="0x10" description="Interrupt Source: Compare down event (CCU5)"/>
                <bitenum id="F" value="0x19" description="Interrupt Source: Fault Event generated an interrupt. (F)"/>
                <bitenum id="TOV" value="0x1A" description="Interrupt Source: Trigger overflow (TOV)"/>
                <bitenum id="REPC" value="0x1B" description="Interrupt Source: Repeat Counter Zero (REPC)"/>
                <bitenum id="DC" value="0x1C" description="Interrupt Source: Direction Change (DC)"/>
                <bitenum id="QEIERR" value="0x1D" description="Interrupt Source:QEI Incorrect state transition error (QEIERR)"/>
            </bitfield>
        </register>
        <register id="TIMG14_GEN_EVENT1_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="Z" description="Zero Event mask" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Disable Event"/>
                <bitenum id="SET" value="0x1" description="Enable Event"/>
            </bitfield>
            <bitfield id="L" description="Load Event mask" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCD0" description="Capture or Compare DN event mask CCP0" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCD1" description="Capture or Compare DN event mask CCP1" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCU0" description="Capture or Compare UP event mask CCP0" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCU1" description="Capture or Compare UP event mask CCP1" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TOV" description="Trigger Overflow Event mask" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Disable Event"/>
                <bitenum id="SET" value="0x1" description="Enable Event"/>
            </bitfield>
            <bitfield id="CCD2" description="Capture or Compare DN event mask CCP2" begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCD3" description="Capture or Compare DN event mask CCP3" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCU2" description="Capture or Compare UP event mask CCP2" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="CCU3" description="Capture or Compare UP event mask CCP3" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
